package loops.tasks


fun main(){

}

/*
Task1: Сумма элементов списка

Задание: Создай список из пяти чисел. Вычисли и выведи сумму всех элементов списка.
*/
fun task1() {
}

/*
Task2: Поиск максимального числа в списке

Задание: Создай список из десяти случайных чисел от 1 до 100. Найди и выведи на экран максимальное число из списка.
*/
fun task2() {

}

/*
Task3: Подсчёт чётных чисел в списке

Задание: Создай список чисел от 1 до 20. Подсчитай и выведи количество чётных чисел в списке.
*/
fun task3() {
}

/*
Task4: Обратный вывод списка

Задание: Попроси пользователя ввести пять слов и сохрани их в список. Выведи слова в обратном порядке.
*/
fun task4() {
}

/*
Task5: Фильтрация списка

Задание: Создай список чисел от 1 до 50. Создай новый список, содержащий только числа, которые делятся на 5 без остатка, и выведи его.
*/
fun task5() {
}

/*
Task6: Таблица умножения

Задание: Выведи на экран таблицу умножения числа 7 с помощью цикла.
*/
fun task6() {
}

/*
Task7: Проверка наличия элемента в списке

Задание: Создай список любимых фруктов. Попроси пользователя ввести название фрукта. Если этот фрукт есть в списке, выведи "Да, я люблю [фрукт]", иначе выведи "Нет, я не люблю [фрукт]".
*/
fun task7() {
}

/*
Task8: Подсчёт гласных в слове

Задание: Попроси пользователя ввести слово. Подсчитай и выведи количество гласных букв в этом слове.
*/
fun task8() {
}

/*
Task9: Простые числа в диапазоне

Задание: Найди и выведи все простые числа от 2 до 30.
*/
fun task9() {
}

/*
Task10: Реверс числа

Задание: Попроси пользователя ввести число. Выведи это число в обратном порядке цифр.
*/
fun task10() {
}
