package org.example.other.hotkeys

/*

    Базовые хоткеи

    Ctrl + C / Ctrl + V  — копировать, вставить.
    Ctrl + X - вырезать
    Ctrl + Z  — отменить последнее действие.
    Ctrl + Shift + Z — повторить отменённое действие.

 */

fun main() {
    // Задание 1: Вырежи строку ниже и вставь её после последнего println.
    println("Hello, world!")

    val a = 10
    val b = 20
    println("Сумма чисел: " + (a + b))

    // Задание 2: Копируй эту строку и вставь её ниже.
    println("Работаем с базовыми хоткеями!")

    // Задание 3: Отмени последнее действие (Ctrl + Z) и повтори его (Ctrl + Shift + Z).
}