package org.example.arrays

fun main() {

}

/*
    Дан массив с оценками учеников
    val grades = arrayOf(3, 5, 4, 2, 1, 5, 3, 4, 3, 5, 1)
    увеличьте все оценки в массиве на +1
 */

fun task0() {

}

/*
    Дан массив чисел 1,2,3,4,5
    Выведите значения из элементов этого массива
    в обратном порядке
 */
fun task1() {

}

/*
    Дан массив размера 10 состоящий из нулей,
    Необходимо заполнить его: [1,0,1,0,1,0,1,0,1,0]
 */
fun task2() {

}

/*
    Дан массив размера 5,
    попроси пользователя заполнить каждый
    элемент массива положительным числом,
    если пользователь введет отрицательное число,
    например: -3 положите в массив положительное: 3
 */
fun task3() {


}
/*
    Дан массив чисел от 1 до 6, нужно изменить массив так,
    чтобы вывод в консоль был сперва:
    1 2 3 4 5 6
    Затем: 2 4 6 8 10 12
    Затем: 1 3 5 7 9 11
    Затем: 1 2 3 4 5 6
 */

fun task4() {
}
/*
    Создайте массив из 8 случайных элементов от 1 до 6,
    Необходимо найти количество всех чисел 4 в этом массиве
 */

fun task5(){

}
/*
    Создайте массив размера 50 состоящий из нулей,
    заполните массив числами от 1 до 50.
    Если число делиться на 5 выведите его на экран

 */
fun task6(){
}
/*
    Создайте массив из 5 строк.
    Создайте новый массив из количества символов в этих строках

    Пример:
    Исходный массив: ["apple", "banana", "kiwi", "grape", "peach"]
    Результат: [5, 6, 4, 5, 5]
 */
fun task7(){

}
/*
    Пользователь вводит число n,
    вам нужно создать массив от этого числа n до 0
    Например: n = 5
    array == [5,4,3,2,1,0]
 */

fun task8(){

}

/*
    Пользователь вводит строку,
    нужно создать массив из символов это строки:
    Например:
    "abc"
    [a],[bb],[ccc]
    "Good"
    [G],[oo],[ooo],[dddd]
 */

fun task9(){

}

/*
    Дан массив:
        val weeks = arrayOf(
        "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"
    )

    Пользователь вводит сегодняшний день,
    программа должна вывести сколько дней осталось до выходных.
    Выходные начинаются с субботы
 */

fun task10(){

}