package org.example.algorithms


fun main(){

}

/*
Task1: Обратный отсчёт
    Задание: Выведи в консоль сообщения о запуске ракеты в обратном порядке от 10 до 1.
    Пример: Ракета будет запущена через: 10
            Ракета будет запущена через: 9
            ...
            Ракета будет запущена через: 1
            Ракета начала запуск!
*/
fun task1() {
}

/*
Task2: Простая последовательность

    Задание: Напиши программу, которая выводит числа 3, 6, 9, 12, 15.
    Подсказка: Используй цикл for с шагом.
*/
fun task2() {
}


/*
Task3: Квадрат из символов

    Задание: Напиши программу, которая выведет в консоль квадрат:
    Пример: #####
            #####
            #####
*/
fun task3(){

}

/*
Task4: Чётные числа

    Задание: Выведи на экран только чётные числа от 1 до 50.
    Подсказка: Используй условие (i % 2 == 0) внутри цикла.
*/
fun task4() {
}

/*
Task5: Бесконечное умножение

    Задание: Дана переменная var num = 1,
    напишите программу, которая умножает переменную num на 2 и выводит результат в консоль
    после чего спрашивает у пользователя, продолжить умножение?
    Если пользователь ответил "Да" умножить переменную еще раз,
    если "Нет" - завершить программу
    Подсказка: num = num * 2
*/
fun task5() {
}

/*
Task6: Случайные итерации

    Задание: Написать программу в которой цикл выполняется случайное количество раз от 1 до 100,
    После выполнения цикла вывести сколько раз выполнялся цикл.

*/
fun task6() {
}

/*
Task7: Повторение строк
    Задание: Напишите программу,
    которая принимает от пользователя целое число n
    и строку s, затем выводит строку s,
    повторенную ровно n раз.
    Пример: n = 6, s = "I" -> "IIIIII"
            n = 5, s = "Hello" -> "HelloHelloHelloHelloHello"
 */
fun task7(){

}

/*
Task8: Символ строки
    Задание: Дана переменная val hw = "Hello world"
    необходимо посчитать сколько символов 'l' находиться в переменной hw
    Подсказка: мы можем получить символ строки используя [index],
    т.е. hw[0] == 'H'
    Подсказка 2: мы можем получить длину всей строки через .length
    т.е. hw.length == 11
    Вывод: программа должна вывести в консоль сообщение:
        "В строке $hw $count символов l"
 */

fun task8(){
}

/*
Task9: Kakoe CloBo
    Задание: Пользователь вводит слово, узнай к какому языку принадлежит это слово,
    к русскому или английскому.
    Подсказка: используй Range от, а до я (а..я) и от (a..z) чтобы узнать
    к какому алфавиту принадлежит буква в слове,
    если все буквы в слове принадлежат к русскому алфавиту то слово русское
 */
fun task9(){
}

/*
Task10: Числа Фибоначчи

    Задание: Напиши программу, которая выводит первые 10 чисел Фибоначчи.
    Числа Фибоначчи начинаются с 0 и 1, а каждое последующее число — это сумма двух предыдущих.
    Подсказка: Используй цикл, чтобы вывести числа Фибоначчи: 0,1,1,2,3,5,8,13,21,34
*/
fun task10(){
}
